// words.js
const nouns = [ // 名词词库（模式A、B使用），一行十个
    "余烬", "雷声", "瀑布", "裂缝", "海水", "街道", "花园", "尘埃", "屋顶", "阁楼", 
    "波浪", "火焰", "寂静", "春天", "野草", "月亮", "谎言", "思绪", "秒针", "泥土",
    "宇宙", "空气", "时间", "灵感", "日出", "黄昏", "黎明", "晚霞", "明日", "过去", 
    "玫瑰", "沙滩", "路灯", "光线", "野心", "自由", "答案", "春雨", "汉堡", "长凳", 
    "世界", "弹壳", "浪声", "雨水", "琴键", "落叶", "种子", "窗户", "规则", "吉他", 
    "蜡笔", "梦境", "旋律", "泪水", "希望", "理智", "小狗", "小猫", "城市", "记忆",
    "偏见", "钥匙", "纽扣", "视线", "繁星", "浪潮", "夜空", "欲望", "暮色", "微风", 
    "翅膀", "羽毛", "灵魂", "悲痛", "盔甲", "抽屉", "意义", "海洋", "信封", "伤疤", 
    "灰尘", "焦虑", "未来", "凌晨", "傍晚", "日落", "话语", "湖底", "寒风", "风铃", 
    "岩石", "影子", "清风", "积水", "掌心", "蝴蝶", "雨声", "烟雾", "花瓣", "暗号", 
    "泡沫", "雪花", "积雪", "星星", "阴影", "旷野", "睡莲", "秋天", "情欲", "镜子", 
    "阵雨", "暴雨", "双唇", "褶皱", "理论", "心跳", "冰块", "野花", "魔法", "数学", 
    "节奏", "闪电", "孤独", "迷雾", "酒杯", "勇气", "愤怒", "面包", "语言", "火柴", 
    "哲学", "落日", "星光", "远山", "废墟", "月色", "深渊", "烈火", "荒原", "苔藓", 
    "钟摆", "浓雾", "枯木", "铁轨", "沉默"
];

const verbs = [ // 动词词库（模式A使用），一行十个
    "跳跃", "沉思", "晃动", "沉默", "漂浮", "遗忘", "喧闹", "燃烧", "静默", "逃离", 
    "灼热", "柔软", "破碎", "迷恋", "模糊", "枯萎", "叹息", "轻盈", "哀求", "流浪", 
    "流淌", "闪耀", "落泪", "共鸣", "潮湿", "旋转", "叛逆", "交谈", "追逐", "修整",
    "等待", "逃避", "不朽", "扬起", "寻找", "经历", "漂泊", "溢出", "绽放", "租借", 
    "缠绵", "呼吸", "堂皇", "反思", "打湿", "起身", "承诺", "孤独", "粉红", "知晓", 
    "昏暗", "滞后", "思考", "涂画", "嘲弄", "陌生", "消退", "纵容", "存在", "入睡", 
    "惋惜", "倾斜", "呐喊", "到达", "感激", "约会", "泛滥", "凌乱", "倾听", "聆听", 
    "单薄", "残缺", "完整", "修复", "妄想", "书写", "淹没", "灿烂", "奔跑", "降落", 
    "拥抱", "暂停", "幻想", "闪烁", "深陷", "挣脱", "眺望", "抬头", "轰鸣", "弹奏", 
    "混淆", "摇摆", "跳舞", "吻别", "喧嚣", "落下", "流动", "指引", "撕扯", "迷茫", 
    "仰望", "点燃", "抓住", "空无", "眨眼", "纷飞", "永恒", "散步", "沮丧", "遇到", 
    "编织", "凝望", "渴求", "答复", "疏远", "隐瞒", "修补", "偏袒", "回避", "融化",
    "称赞", "渴望", "沉迷", "察觉", "反抗", "积攒", "鼓励", "陶醉", "哀愁", "晶莹", 
    "火热", "绚丽", "落寞", "痛苦", "无限", "追问", "见证", "停滞", "支撑", "谈论", 
    "温暖", "滋长", "蔓延", "熟睡", "伶俐", "弥漫", "喝彩", "欢呼", "褪色", "寂寞", 
    "遗憾"
];

const highlights = [    // 一行六个
    "大海的野心。", "“去看海吧”", "等待。", "是这样吗？", "一切照旧。", "声音的颗粒感", 
    "远离纷扰。", "拥抱自由。", "无动于衷。", "没有什么不可以", "你是否会有所怀念", "LOVE",
    "一种异乎寻常。", "无法停止。", "夜晚继续扩张", "一切皆为无物。", "梦境还是现实？", "几乎消失不见", 
    "Memory is vivid.", "If it were meant to come.", "It's a joke.", "I guess.", "L'amour", "从昨天到今天", 
    "wind stroking my ears", "I'm losing my mind.", "有天我们会再次相见", "在世界尽头", "Let it pour.",  "在阳光下", 
    "时间仿佛被定格", "安静突然来临", "转瞬即逝的。", "近乎完美。", "点燃世界", "小鸟，抖落星辰", 
    "shadows on the wall", "I don't know other places.", "I don't hope for the greatest.", "痛苦依旧", "过客。", "秘密。",
    "Can you call me loud.", "天空坠入海洋", "这一切，都与我无关。", "扬起灰烬", "在星期天早晨", "“干杯。”", 
    "太阳升起。", "“出发！”", "片刻永恒", "昨天、今天、明天", "微风吹过", "在海的对面", 
    "这延绵的故事还未了", "独处的时候", "不留痕迹", "无需解释", "万事休矣。", "而这是不可能的", 
    "而我，一个纯粹的旁观者", "如此之深", "恋爱，不过如此", "无论如何，这都会发生", "时间停止", "一片草叶从土地长出",
    "我不曾感觉到这一切", "尚未结束", "永远，许多永远。", "在废墟的边缘", "日日夜夜，时时刻刻", "以每秒三十分钟的速度"
];

const verbs2 = [ // 第二组动词（模式B使用），一行十个
    "晃动", "遗忘", "亲吻", "迷恋", "共鸣", "旋转", "选择", "租借", "弹奏", "聆听", 
    "逃避", "点亮", "扬起", "寻找", "打湿", "承诺", "思考", "涂画", "支撑", "温暖", 
    "嘲弄", "纵容", "惋惜", "逃离", "等待", "感激", "约会", "修复", "见证", "哀求", 
    "妄想", "书写", "淹没", "拥抱", "暂停", "幻想", "走过", "深陷", "融化", "追问", 
    "挣脱", "眺望", "混淆", "指引", "倾听", "知晓", "溢出", "相信", "激起", "回避", 
    "追逐", "向往", "撕扯", "仰望", "点燃", "抓住", "飞过", "邀请", "滋长", "谈论", 
    "编织", "凝望", "渴求", "答复", "疏远", "隐瞒", "修补", "偏袒", "鼓励", "陶醉", 
    "称赞", "渴望", "沉迷", "察觉", "反抗", "积攒", "遇到", "修整"
];

const adj2 = [   // 第二组形容词（模式B使用），一行十个
    "跳跃的", "沉思的", "晃动的", "沉默的", "漂浮的", "遗忘的", "喧闹的", "燃烧的", "灼热的", "弯曲的", 
    "柔软的", "破碎的", "模糊的", "枯萎的", "叹息的", "流淌的", "闪耀的", "落泪的", "珍贵的", "压皱的", 
    "潮湿的", "旋转的", "叛逆的", "等待的", "逃避的", "不朽的", "漂泊的", "缠绵的", "熟睡的", "潜在的", 
    "呼吸的", "堂皇的", "反思的", "起身的", "孤独的", "昏暗的", "滞后的", "陌生的", "消退的", "蔓延的", 
    "倾斜的", "呐喊的", "到达的", "泛滥的", "单薄的", "残缺的", "完整的", "灿烂的", "闪烁的", "停滞的", 
    "摇摆的", "跳舞的", "吻别的", "喧嚣的", "落下的", "流动的", "抬头的", "轰鸣的", "奔跑的", "无限的", 
    "降落的", "凌乱的", "存在的", "入睡的", "粉红的", "交谈的", "轻盈的", "静默的", "掉落的", "痛苦的", 
    "流浪的", "飘落的", "绽放的", "零碎的", "迷茫的", "空无的", "纷飞的", "永恒的", "沮丧的", "落寞的", 
    "哀愁的", "晶莹的", "火热的", "绚丽的", "流浪的", "伶俐的", "弥漫的", "褪色的", "寂寞的", "遗憾的"
];

const titles = [   // 标题，一行六个
    "《静默》", "《在海边散步》", "《时间的暴力》", "《在一个雨天》", "《年复一年》", "《xx的瞬间》", 
    "《有一个人说》", "《如果我不是》", "《时间叫喊着》", "《重要的是》", "《在你我之间》", "《相当于永恒的瞬间意义的》", 
    "《当哲学家突然悟出真理时》", "《那一刻》", "《我将在》", "《在一个秋天的星期五》", "《当我拿起笔》", "《见证者》", 
    "《一瞬》", "《déjà-vu》", "《我看着》", "《整体的局部》", "《今夜》", "《凌晨》", 
    "《一公顷的颤抖》", "《或者，如果》",  "《如果世界向你提问》", "《而你刚好无所事事》", "《本质》", "《因此》"
];

const noun3 = [ // 名词词库（模式C使用），一行十个
    "余烬，", "雷声，", "裂缝，", "海水，", "街道，", "花园，", "尘埃，", "酒杯，", "勇气，", "愤怒，", 
    "波浪，", "寂静，", "春天，", "野草，", "月亮，", "谎言，", "思绪，", "闪电，", "孤独，", "迷雾，",	
    "宇宙，", "空气，", "时间，", "灵感，",	"日出，", "黄昏，", "黎明，", "晚霞，",	"明日，", "过去，",
    "玫瑰，", "沙滩，", "路灯，", "光线，",	"野心，", "自由，", "答案，", "春雨，", "月色，", "深渊，", 
    "世界，", "浪声，", "雨水，", "琴键，", "落叶，", "种子，", "规则，", "吉他，", "深渊，", "荒原，", 
    "蜡笔，", "梦境，", "旋律，", "泪水，",	"希望，", "理智，", "记忆，", "远山，",	"废墟，", "月色，", 
    "偏见，", "视线，", "繁星，", "浪潮，", "夜空，", "欲望，", "暮色，", "微风，", "落日，", "星光，", 
    "翅膀，", "羽毛，", "灵魂，", "悲痛，",	"盔甲，", "抽屉，", "意义，", "海洋，",	"信封，", "伤疤，",
    "灰尘，", "焦虑，", "未来，", "凌晨，",	"傍晚，", "日落，", "话语，", "寒风，", "风铃，", "节奏，", 
    "影子，", "清风，", "蝴蝶，", "雨声，", "烟雾，", "花瓣，", "心跳，", "冰块，", "野花，", "魔法，",
    "泡沫，", "雪花，", "积雪，", "星星，",	"阴影，", "旷野，", "睡莲，", "秋天，",	"情欲，", "镜子，",
    "阵雨，", "暴雨，", "双唇，", "哲学，", "沉默，"
];

const adv3 = [ // 副词词库（模式C使用），一行十个
    "美得", "冷得", "静得", "落得", "噪得", "淡得", "深得", "碎得", "闪得", "乱得", 
    "轻得", "清得", "傲得", "痛得", "软得", "跳得", "等得", "望得", "缓得", "醉得", 
    "亮得", "飘得", "纯得", "暗得", "重得", "笑得", "耀得", "怒得", "烫得", "冰得", 
    "爱得", "响得", "吵得", "空得", "涩得", "沉得", "倦得", "怅得", "远得", "幻得", 
    "虚得", "落得", "漫得", "荡得", "晃得", "摇得", "迟得", "散得"
];


const adj3= [ // 形容词词库（模式C使用），一行十个
    "疯狂。", "张扬。", "汹涌。", "华丽。", "荒凉。", "卑微。", "放肆。", "孤傲。", "纯粹。", "盛大。", 
    "残忍。", "高傲。", "苍凉。", "空洞。", "孤独。", "绝望。", "清醒。", "颓废。", "坚定。", "锋利。", 
    "狰狞。", "空旷。", "轰鸣。", "荒芜。", "潦草。", "陈旧。", "模糊。", "沉默。", "喧闹。", "闪耀。", 
    "灼热。", "痛苦。", "落寞。", "不朽。", "昏暗。", "残缺。", "泛滥。", "喧嚣。", "缠绵。", "完整。", 
    "轻盈。", "迷茫。", "灿烂。", "沉迷。", "永恒。", "空无。", "伶俐。", "疏远。", "弥漫。", "轰动。", 
    "陶醉。", "狂妄。", "优雅。", "从容。", "褪色。", "寂寞。", "遗憾。"
];
